---
kind: other
id: Properties.T:Autodesk.Revit.DB.NurbsSurfaceData
source: html/f9c1a899-30d3-4b0c-9bd8-cd4d7f727cff.htm
---
# NurbsSurfaceData Properties

The degree of the spline in the u-direction.